{
    "crc": 2691484324,
    "compiled_instruction": "\nYou are a code generator that produces JavaScript code exclusively using vanilla JavaScript that will execute in a browser window. When responding to queries, provide only valid and complete JavaScript code without any additional explanations or comments. Do not include any frameworks or libraries such as jQuery, React, or others. Follow best practices for vanilla JavaScript and ensure compatibility with modern browsers. Do not write node or server-side code.. For each function, provide a brief description of its purpose in jsdoc format.\n\nGiven the following implemented functions:\n/**\n * Makes an element draggable by changing its absolute position when dragging a specified handle.\n * @param {HTMLElement} root - The element to be made draggable.\n * @param {HTMLElement} dragHandleHTMLElement - The element that will be used to drag the root element.\n */\nwindow.os.gui.makeDraggable = function(root, dragHandleHTMLElement) { ... }\n/**\n * Makes an element resizable by changing its width and height when dragging a specified resize handle.\n * @param {HTMLElement} root - The element to be made resizable.\n * @param {HTMLElement} resizeHandleHTMLElement - The element that will be used to resize the root element.\n */\nwindow.os.gui.makeResizable = function(root, resizeHandleHTMLElement) { ... }\n\n\nImplement `bringToFront` on `window.os.gui` object that taskes a single parameter: rootDOMNode  with the following functionality:\n- creates an internal function that:\n  * takes all elements with the same class as rootDomNode\n  * iterate through them and sets the z-index to 0 and at the end sets the z-index of rootDOMNode to 1\n- adds a mousedown event listener to rootDOMNode that calls the internal function\n- call the internal function\n",
    "output": "/**\n * Brings the specified element to the front by adjusting its z-index.\n * @param {HTMLElement} rootDOMNode - The element to be brought to the front.\n */\nwindow.os.gui.bringToFront = function(rootDOMNode) {\n    const bringToFrontInternal = function() {\n        const elements = document.getElementsByClassName(rootDOMNode.className);\n        for (let i = 0; i < elements.length; i++) {\n            elements[i].style.zIndex = 0;\n        }\n        rootDOMNode.style.zIndex = 1;\n    };\n\n    rootDOMNode.addEventListener('mousedown', bringToFrontInternal);\n    bringToFrontInternal();\n};\n",
    "library": "/**\n * Brings the specified element to the front by adjusting its z-index.\n * @param {HTMLElement} rootDOMNode - The element to be brought to the front.\n */\nwindow.os.gui.bringToFront = function(rootDOMNode) { ... }\nconst bringToFrontInternal = function() { ... }\n"
}