{
    "crc": 3224837018,
    "compiled_instruction": [
        "do not use jquery.\n `window.os` object is already defined.\n### Instruction:\n Implement `bringToFront(rootDOMNode)` on the `window.os.gui` that:\n- creates an internal function that:\n  * takes all elements with the same class as rootDomNode\n  * iterate through them and sets the z-index to 0\n  * sets the z-index of rootDOMNode to 1\n- adds a mousedown event listener to rootDOMNode that calls the internal function \n### Response:\n"
    ],
    "output": [
        "Here's how you can implement this in JavaScript:\n\n```javascript\nif (!window.os || !window.os.gui) {\n    window.os = window.os || {};\n    window.os.gui = window.os.gui || {};\n}\n\nwindow.os.gui.bringToFront = function (rootDomNode) {\n    // Internal function to bring other nodes to front\n    var bringOthersToFront = function () {\n        // Get all nodes with same class as rootDomNode\n        var nodes = document.getElementsByClassName(rootDomNode.className);\n        // Iterate through them and set z-index to 0\n        for (var i = 0; i < nodes.length; i++) {\n            nodes[i].style.zIndex = 0;\n        }\n        // Set z-index of rootDomNode to 1\n        rootDomNode.style.zIndex = 1;\n    }\n    \n    // Add mousedown event listener to rootDomNode\n    rootDomNode.addEventListener('mousedown', bringOthersToFront);\n}\n\n```"
    ],
    "library": "The provided code defines a function named `bringToFront` on the `window.os.gui` object. This function takes a single argument, `rootDomNode`, which is expected to be a DOM node in your HTML document. \n\nThe function works by adding a 'mousedown' event listener to `rootDomNode`. When this event is triggered, it calls a function named `bringOthersToFront`, which is defined within the scope of `bringToFront`. \n\nThe `bringOthersToFront` function does two things: \n1. It gets all DOM nodes in your document that have the same class as `rootDomNode` and assigns them to a variable named `nodes`. \n2. It iterates over each of these nodes, setting their CSS property 'z-index' to 0, effectively hiding them behind other elements with a lower 'z-index'. \n\nFinally, it sets the 'z-index' of `rootDomNode` to 1, effectively bringing it to the front of your document, and making it visible above all other elements with a lower 'z-index'. \n\nSo, in summary, this function allows you to bring any DOM node to the front of your document by clicking on it with your mouse, effectively bringing all other nodes with the same class behind it. \n\nPlease note that this code assumes that you have a valid DOM node passed to it when you call `bringToFront(myNode)`, where 'myNode' is a DOM element in your HTML document. If you call this function with an invalid node, it may not work as expected or may cause your script to crash. \n\nAlso, this code does not handle situations where multiple elements with the same class exist in your document, or where multiple instances of this function are called with different nodes. If you need to handle these cases, you would need to modify this code to suit your specific needs.\n\n```"
}