{
    "crc": 1201881582,
    "compiled_instruction": [
        "You are a frontend web developer, do not use jquery that writes only browser JS, JavaScript, HTML and CSS\n### Instruction:\nGiven the following examples:\n This JavaScript code defines a function `createWindow` in the `window.os.gui` namespace. This function creates a new window with customizable parameters such as emoji, title, width, and height. The created window includes elements like title bar, toolbar, content area, status bar, and resize handle. The function also includes functionality to make the window draggable and resizable using specific elements in the DOM. The created window is then positioned in the center of the document and returned as the root DOM node.\n\nHere is how you can use this function in your code:\n\n```javascript\n// Create new window with emoji, title, width, and height\nvar newWindow = window.os.gui.createWindow('🖥️', 'My Window', 600, 400);\n```\n\nIn this example, a new window with an emoji of '🖥️', title 'My Window', width of 600 pixels, and height of 400 pixels is created and returned as `newWindow`. You can then manipulate this `newWindow` object in your code as needed. Please note that this code assumes that other necessary functions like `bringToFront`, `titleBar`, `makeDraggable`, and `makeResizable` have been defined elsewhere in your codebase.\n\n```This JavaScript code defines a function named `attachToWindow` within the `os.gui` namespace of the `window` object. This function takes two arguments, `windowElement` and `contentElement`, and attaches `contentElement` to `.contentPlaceholder` of `windowElement`. Here's how you can use this function:\n\n```javascript\n// Assume we have an HTML element with class 'contentPlaceholder' in our window\nvar myWindow = document.getElementById('myWindow');\n\n// Assume we have an HTML element we want to attach to our window\nvar myContent = document.getElementById('myContent');\n\n// Call attachToWindow with our elements\nwindow.os.gui.attachToWindow(myWindow, myContent);\n```\nIn this example, `myContent` will be appended to `myWindow`'s `contentPlaceholder`. The `contentPlaceholder` is selected using `querySelector`, which returns the first element in the document that matches the specified selector, or null if no matches found. The `appendChild` method adds a node to the end of the list of children of a specified parent node. If the given child is a reference to an existing node in the document, `appendChild` moves it from its current position to the new position.\n\n```Sure, here is how you can use this `window.os.addApp` function:\n\n```javascript\n// Define your emoji, title and callback function\nvar emoji = '🚀';\nvar title = 'My App';\nvar callback = function() {\n  console.log('Callback called');\n};\n\n// Call addApp function with emoji, title and callback as arguments\nwindow.os.addApp(emoji, title, callback);\n```\n\nIn this example, `emoji` is '🚀', `title` is 'My App', and `callback` is an anonymous function that logs 'Callback called'. These values can be replaced with your own values as needed. The `window.os.addApp` function will then use these values to add an application to your desktop. The specifics of how this is done will depend on how your `icon` function is implemented. \n\nPlease note that this is just an example and you may need to adjust this code to fit your specific needs or environment.\n\n```This JavaScript function `window.os.getOSIcon` is used to create an icon for a file or directory at a given path. The icon includes an emoji indicating whether it is a file or directory, a title showing the name of the file or directory, and an optional emoji from an application registry if the file has an associated extension. \n\nThe function takes two parameters: `path` (a string representing the file or directory path), and `callback` (a function to be called when the icon is clicked). \n\nHere is an example of how to use this function:\n\n```javascript\nconst iconDiv = window.os.getOSIcon('/home/user/documents/myfile.txt', (path) => {\n  console.log('File clicked:', path);\n});\ndocument.body.appendChild(iconDiv);\n```\n\nIn this example, `/home/user/documents/myfile.txt` is passed as the `path` parameter and an anonymous function is passed as the `callback` parameter. The anonymous function logs to the console when the icon is clicked. The returned `iconDiv` is then appended to the body of the HTML document. \n\nPlease note that this code assumes that `window.os.fs.isFile` and `window.os.registry` exist and work as expected. The `isFile` method checks if the path is for a file and `registry` is an object where file extensions can be mapped to emojis and callbacks. If an extension is found in `registry`, an additional emoji and callback will be added to the icon. \n\nAlso note that this code assumes Unix-style paths (i.e., paths separated by slashes), and it uses the last part of the path as the title (i.e., the filename). If your paths use different conventions, you may need to adjust this code accordingly.\n\n```\n\n create a new function `registerApplication` on the `window.os` object that takes a title, emoji, callback, width=400 and height = 400 and a an array of extensions being undefined by default having the following functionality:\n- define an internal `execute` that takes a spread params:\n  - creates a new window instance with the title, emoji, width and height and saves it to a constant\n  - attach to window the result of calling the callback with the window instance and spread params\n- if extensions is defined, call `registerExtension` for each extension with the emoji and the execute function\n- call addApp with the emoji, title and execute function \n### Response:\n"
    ],
    "output": [
        "// Define the registerApplication function on the os object\nwindow.os.registerApplication = function(title, emoji, callback, width=400, height=400, extensions=undefined) {\n  // Define an internal execute function\n  const execute = (...params) => {\n    // Create a new window instance with the title, emoji, width and height\n    const appWindow = window.os.gui.createWindow(emoji, title, width, height);\n    \n    // Attach to window the result of calling the callback with the window instance and spread params\n    const content = callback(appWindow, ...params);\n    window.os.gui.attachToWindow(appWindow, content);\n  };\n  \n  // If extensions is defined, call registerExtension for each extension with the emoji and the execute function\n  if (extensions) {\n    extensions.forEach(extension => {\n      window.os.registerExtension(extension, emoji, execute);\n    });\n  }\n  \n  // Call addApp with the emoji, title and execute function \n  window.os.addApp(emoji, title, execute);\n};\n\n"
    ],
    "library": "This JavaScript code defines a `registerApplication` function on the `os` object of the `window` object. This function is used to register an application with the operating system. \n\nHere's how you can use it:\n\n```javascript\n// Assume window.os.gui and window.os.addApp and window.os.registerExtension are already defined elsewhere in your code\n\n// Define your application's title, emoji and callback function\nconst title = \"My App\";\nconst emoji = \"🚀\";\nconst callback = (appWindow, param1, param2) => {\n  // Your code here to create and return content for your application window\n};\nconst width = 800;  // Optional, default is 400\nconst height = 600;  // Optional, default is 400\nconst extensions = [\"ext1\", \"ext2\"];  // Optional, default is undefined\n\n// Register your application with the operating system\nwindow.os.registerApplication(title, emoji, callback, width, height, extensions);\n```\n\nIn this example, `callback` is a function that is called when your application is launched and is responsible for creating and returning content for your application window. The `appWindow` parameter is an instance of your application window and `param1` and `param2` are additional parameters passed to your `callback` function when your application is launched. \n\nThe `width` and `height` parameters specify the initial size of your application window and they default to 400 if not provided. \n\nThe `extensions` parameter is an optional array of extension names to be registered with your application. If provided, each extension will be registered with your application's `emoji` and `execute` function. \n\nFinally, `window.os.addApp` is called with your application's `emoji`, `title` and `execute` function to add your application to the operating system's list of applications. \n\nThis is just an example of how you might use this `registerApplication` function in your code. The actual implementation of `window.os.gui`, `window.os.addApp` and `window.os.registerExtension` would depend on how these functions and objects are defined elsewhere in your code.\n\n```",
    "library_input": "### Instruction:\nYou are a javascript developer that documents all the declared functions by providing sample usage.\n```\n // Define the registerApplication function on the os object\nwindow.os.registerApplication = function(title, emoji, callback, width=400, height=400, extensions=undefined) {\n  // Define an internal execute function\n  const execute = (...params) => {\n    // Create a new window instance with the title, emoji, width and height\n    const appWindow = window.os.gui.createWindow(emoji, title, width, height);\n    \n    // Attach to window the result of calling the callback with the window instance and spread params\n    const content = callback(appWindow, ...params);\n    window.os.gui.attachToWindow(appWindow, content);\n  };\n  \n  // If extensions is defined, call registerExtension for each extension with the emoji and the execute function\n  if (extensions) {\n    extensions.forEach(extension => {\n      window.os.registerExtension(extension, emoji, execute);\n    });\n  }\n  \n  // Call addApp with the emoji, title and execute function \n  window.os.addApp(emoji, title, execute);\n};\n\n \n```\n### Response:\n"
}